GAULAvionique2024-2025/Ordinateur-de-bord/STM32CubeIDE/ODB2/Core/Inc/GAUL_Drivers/Components/ICM20948.h
#ifndef INC_GAUL_DRIVERS_COMPONENTS_ICM20948_H_
#define INC_GAUL_DRIVERS_COMPONENTS_ICM20948_H_


#include "stm32f4xx.h"
#include "math.h"
#include "GAUL_Drivers/Components/ICM20948.h"
#include "GAUL_Drivers/Low_Level/SPI_driver.h"
#include "GAUL_Drivers/Low_Level/GPIO_driver.h"

#define ICM20948_REG_BANK_SEL              	0x7F
#define ICM20948_VAL_USER_BANK_0            0x00
#define ICM20948_VAL_USER_BANK_1			0x01
#define ICM20948_VAL_USER_BANK_2            0x20
// BANK 0
#define ICM20948_REG_WHO_AM_I				0x00
#define ICM20948_REG_USER_CTRL				0x03
#define ICM20948_REG_PWR_MGMT_1            	0x06
#define ICM20948_REG_PWR_MGMT_2            	0x07
#define ICM20948_REG_INT_PIN_CFG			0x0F
#define ICM20948_REG_ACCEL_XOUT_H          	0x2D
// BANK 1 (self test)
//BANK 2
#define ICM20948_REG_GYRO_SMPLRT_DIV		0x00
#define ICM20948_REG_GYRO_CONFIG_1			0x01
#define ICM20948_REG_GYRO_CONFIG_2			0x02 // Self Test
#define ICM20948_REG_ACCEL_SMPLRT_DIV_1		0x10
#define ICM20948_REG_ACCEL_SMPLRT_DIV_2		0x11
#define ICM20948_REG_ACCEL_CONFIG			0x14
#define ICM20948_REG_ACCEL_CONFIG_2			0x15
#define ICM20948_REG_TEMP_CONFIG			0x53

#define ICM20948_VAL_WHO_AM_I              	0x12//0xEA
#define GYRO_SENS	16.384f // Precision
#define ACCEL_SENS  2048.0f // Precision
#define PI          3.14159265359f

typedef struct {
	SPI_TypeDef		*SPIx;
	GPIO_TypeDef 	*cs_port;
	uint8_t      	cs_pin;

	uint8_t      	int_pin;
	GPIO_TypeDef 	*int_port;

	float 			gyroX, gyroY, gyroZ;
	float 			accX, accY, accZ;
	float 			temperatureC;
	float 			accResult;
	float 			angle_pitch_acc;
	float 			angle_roll_acc;
	float 			angleX;
	float 			angleY;
} ICM20948;

int8_t ICM20948_Init(ICM20948 *dev);
void ICM20948_ReadData(ICM20948 *dev);
int8_t ICM20948_Data_Ready(ICM20948 *dev);

#endif /* INC_GAUL_DRIVERS_COMPONENTS_ICM20948_H_ */
